src/cf/DataProcessors/ТорговаяКонсоль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ТорговаяКонсоль</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяПланета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланетаПрейскуранта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьТрюма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободноВТрюме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенегВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Магазин</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПокупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТрюмКорабля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ТорговаяКонсоль/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция СтоимостиТоваровНаПланете(Планета) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Товар");
	Результат.Колонки.Добавить("ЦенаПокупки");
	Результат.Колонки.Добавить("ЦенаПродажи");
	
	Если Планета.Пустая() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяПланеты = Планета.ИмяПредопределенныхДанных;
	
	Макет = ПолучитьМакет("Прейскурант");
	
	КоличествоСтрок = Макет.ВысотаТаблицы;
	КоличествоКолонок = Макет.ШиринаТаблицы;
	
	Для ИндексКолонки = 1 По КоличествоКолонок Цикл
		
		НазваниеКолонки = Макет.Область(1, ИндексКолонки).Текст;
		Если НазваниеКолонки = ИмяПланеты Тогда
			
			Для ИндексСтроки = 2 По КоличествоСтрок Цикл
				
				ЦенаПокупки = Макет.Область(ИндексСтроки, ИндексКолонки).Текст;
				Если ЦенаПокупки <> "-" Тогда
					
					ИмяТовара = Макет.Область(ИндексСтроки, 0).Текст;
					
					Товар = Справочники.Товары[ИмяТовара];
					
					ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
					ЦенаПокупки = ОписаниеТипаЧисло.ПривестиЗначение(ЦенаПокупки);
					ЦенаПродажи = Макет.Область(ИндексСтроки, ИндексКолонки + 1).Текст;
					ЦенаПродажи = ОписаниеТипаЧисло.ПривестиЗначение(ЦенаПродажи);
					
					СтрокаРезультата = Результат.Добавить();
					СтрокаРезультата.Товар = Товар;
					СтрокаРезультата.ЦенаПокупки = ЦенаПокупки;
					СтрокаРезультата.ЦенаПродажи = ЦенаПродажи;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
